[
  {"id":"schneiderToolboxScorebasedMeasurement2021","abstract":"Abstract\n            \n              The detection of differential item functioning (DIF) is a central topic in psychometrics and educational measurement. In the past few years, a new family of score-based tests of measurement invariance has been proposed, which allows the detection of DIF along arbitrary person covariates in a variety of item response theory (IRT) models. This paper illustrates the application of these tests within the R system for statistical computing, making them accessible to a broad range of users. This presentation also includes IRT models for which these tests have not previously been investigated, such as the generalized partial credit model. The paper has three goals: First, we review the ideas behind score-based tests of measurement invariance. Second, we describe the implementation of these tests within the R system for statistical computing, which is based on the interaction of the R packages\n              mirt\n              ,\n              psychotools\n              and\n              strucchange\n              . Third, we illustrate the application of this software and the interpretation of its output in two empirical datasets. The complete R code for reproducing our results is reported in the paper.","accessed":{"date-parts":[["2025",9,3]]},"author":[{"family":"Schneider","given":"Lennart"},{"family":"Strobl","given":"Carolin"},{"family":"Zeileis","given":"Achim"},{"family":"Debelak","given":"Rudolf"}],"citation-key":"schneiderToolboxScorebasedMeasurement2021","container-title":"Behavior Research Methods","container-title-short":"Behav Res","DOI":"10.3758/s13428-021-01689-0","ISSN":"1554-3528","issue":"5","issued":{"date-parts":[["2021",12,16]]},"language":"en","note":"IRT","page":"2101-2113","source":"DOI.org (Crossref)","title":"An R toolbox for score-based measurement invariance tests in IRT models","type":"article-journal","URL":"https://link.springer.com/10.3758/s13428-021-01689-0","volume":"54"}
]
